let a = +prompt("День")
let b = +prompt("месяц")
if ((20 <= a && a <= 31) && (b == 1) || (1 <= a && a <= 18) && (b == 2)) {
    alert("Водолей");
}
else if ((19 <= a && a <= 29) && (b == 2) || (1 <= a && a <= 20) && (b == 3)) {
    alert("Рыбы");
}
else if ((21 <= a && a <= 31) && (b == 3) || (1 <= a && a <= 19) && (b == 4)) {
    alert("Овен");
}
else if ((20 <= a && a <= 30) && (b == 4) || (1 <= a && a <= 20) && (b == 5)) {
    alert("Телец");
}
else if ((21 <= a && a <= 31) && (b == 5) || (1 <= a && a <= 21) && (b == 6)) {
    alert("Близнецы");
}
else if ((21 <= a && a <= 30) && (b == 6) || (1 <= a && a <= 22) && (b == 72)) {
    alert("Рак");
}
else if ((23 <= a && a <= 31) && (b == 7) || (1 <= a && a <= 22) && (b == 8)) {
    alert("Лев");
}
else if ((23 <= a && a <= 31) && (b == 8) || (1 <= a && a <= 22) && (b == 9)) {
    alert("Дева");
}
else if ((23 <= a && a <= 30) && (b == 9) || (1 <= a && a <= 22) && (b == 10)) {
    alert("Весы");
}
else if ((23 <= a && a <= 31) && (b == 10) || (1 <= a && a <= 22) && (b == 11)) {
    alert("Скарпион");
}
else if ((23 <= a && a <= 30) && (b == 11) || (1 <= a && a <= 21) && (b == 12)) {
    alert("Стрелец");
}
else if ((22 <= a && a <= 31) && (b == 12) || (1 <= a && a <= 19) && (b == 1)) {
    alert("Козерок");
}
else {
    alert(
        "нету такого числа"
    )
}





// let a = +prompt("День")
// let b = +prompt("месяц")
// switch(true){
    
// case ((20 <= a && a <= 31) && (b == 1) || (1 <= a && a <= 18) && (b == 2)):
//     alert("Водолей");
//     break;

// case ((19 <= a && a <= 31) && (b == 2) || (1 <= a && a <= 20) && (b == 3)):
//     alert("Рыбы");
//     break;

// case ((21 <= a && a <= 31) && (b == 3) || (1 <= a && a <= 19) && (b == 4)):
//     alert("Овен");
//     break;

// case ((20 <= a && a <= 31) && (b == 4) || (1 <= a && a <= 20) && (b == 5)):
//     alert("Телец");
//     break;

// case ((21 <= a && a <= 31) && (b == 5) || (1 <= a && a <= 21) && (b == 6)):
//     alert("Близнецы");
//     break;

// case ((21 <= a && a <= 31) && (b == 6) || (1 <= a && a <= 22) && (b == 72)):
//     alert("Рак");
//     break;

// case((23 <= a && a <= 31) && (b == 7) || (1 <= a && a <= 22) && (b == 8)):
//     alert("Лев");
//     break;
// case ((23 <= a && a <= 31) && (b == 8) || (1 <= a && a <= 22) && (b == 9)):
//     alert("Дева");
//     break;
// case ((23 <= a && a <= 31) && (b == 9) || (1 <= a && a <= 22) && (b == 10)):
//     alert("Весы");
//     break;

// case ((23 <= a && a <= 31) && (b == 10) || (1 <= a && a <= 22) && (b == 11)):
//     alert("Скарпион");
//     break;

// case((23 <= a && a <= 31) && (b == 11) || (1 <= a && a <= 21) && (b == 12)):
//     alert("Стрелец");
//     break;

// case((22 <= a && a <= 31) && (b == 12) || (1 <= a && a <= 19) && (b == 1)):
//     alert("Козерок");
//     break;

// default:
//     alert(
//         "нету такого числа"
//     )

// }